Repository: geopozo/pozo
Catalog: pozo/locale/*/LC_MESSAGES/pozo.po
Languages: es

source: Can be a single color value or list of color values from colour package
es: Se puede un color o lista de colores del paquete "colour"

source: A number in pixels
es: Un número en píxeles

source: If true, will force show the item even if it has no data
es: Si "True", hará la unidad visible, incluso si no tiene datos

source: If true, will not show the item
es: Si "True", no hará la unidad visible

source: Sets the default min and max x value for this item
es: Se pone el mínimo y el máximo del valor para esta unidad

source: Specifies the range units
es: Se ponen las unidades del rango "range"

source: Can be log or linear
es: Se puede ser "log" o "linear"

source: A plotly fill description EXPERIMENTAL
es: Un relleno de estilo plotly EXPERIMENTAL

source: Color of the fill EXPERIMENTAL
es: Color del relleno EXPERIMENTAL

source: A fill between two separate axes EXPERIMENTAL
es: Un relleno entres dos ejes diferentes EXPERIMENTAL

source: package theme: a theme engine for pozo The theme package provides several theme objects, which can be attached to pozo graphs, tracks, axes, and traces (.set_theme()) to provide information about styling during rendering. Regular dictionaries can be theme objects, and their possible keys are described here. Other theme objects are described in their own documentation.
es: paquete theme (tema): un motor de tema El paquete "theme" provee varios objetos de tema, lo que se pueden adjuntar a pozo.Graph, pozo.Track, pozo.Axis, y pozo.trace (`.set_theme()`) para proveer información del estilo sobre la renderización. Dicionarrios sencillos se pueden usar como objetos de tema, y sus claves posibles se describen acá. Otras opciones de objetos de tema se describen en su propio .help().

source: Possible theme keys:
es: Claves de tema posibles:

source: method set_theme: sets the theme of object Args: theme (Theme or dict): The theme you'd like to set
es: método set_theme (pon_tema): se pone el tema del objeto Args: theme (Theme o dict): El tema para ponerse

source: method get_theme: returns a context-less theme definition Returns: A theme, no context attached
es: método get_theme (saca_tema): se duevlve un tema sin contexto Devuelve: Un tema, sin contexto

source: class Axis: part of a coordinate system and contains various pozo.Trace (and other drawables)
es: clase Axis (eje): parte de un sistema de coordinadas y contiene varios objetos pozo.Trace (y otros dibujables)

source: package pozo: the visualization engine, pozo Para cambiar a español: `pozo.es()` https://github.com/geopozo/pozo-demo is a good learning template and quickstart. ***** Description: pozo creates a tree structure to describe your graph: ───Graph─┬─Track───Axis─┬─Trace: "CALI" │ └─Trace: "CGR" ├─Track─┬─Axis─┬─Trace: "RHOB" │ │ ├─Trace: "NPHI" │ │ ├─Trace: "LLD" │ │ └─Trace: "LLS" │ └─Axis───Trace: "ARP" └─Track───Axis───Trace: "RPA" ***** Highlighted sub-Objects: Main Objects: pozo.Graph - The main object. pozo.Trace - What stores data point and line data. Highlighted Items: pozo.themes.cangrejo - A basic theme to jump-start styling. e.g. `myGraph.set_theme("cangrejo")` pozo.units.check_las() - Print basic data analysis and sanitizing on your las files.
es: paquete pozo: el motor de visualización To change the english: `pozo.en()` https://github.com/geopozo/pozo-demo-es es una buena plantilla. ***** Descripción: pozo crea una estructura de árbol para describir el gráfico: ───Graph─┬─Track───Axis─┬─Trace: "CALI" │ └─Trace: "CGR" ├─Track─┬─Axis─┬─Trace: "RHOB" │ │ ├─Trace: "NPHI" │ │ ├─Trace: "LLD" │ │ └─Trace: "LLS" │ └─Axis───Trace: "ARP" └─Track───Axis───Trace: "RPA" ***** sub-Objetos Destacados: Objetos Principales: pozo.Graph - El gráfico. pozo.Trace - Lo que guarda los puntos y lineas (los datos). Unidades Destacadas: pozo.themes.cangrejo - Un tema principal para empezar con un estilo. `myGraph.set_theme("cangrejo")` pozo.units.check_las() - Imprimir un análisis basico para ayudar a lavar los archivos de las.

source: method set_name: set name/mnemonic of trace Args: name (str): The name/mnemonic you'd like to set
es: método set_name (pon_nombre): fijar el nombre/mnemotécnica del trazo Args: name (str): El nombre/mnemotécnica para poner

source: method get_name: get name/mnemonic of trace Returns: The name/mnemonic of the trace
es: método get_name (saca_nombre): conseguir el nombre/mnemotécnica del trazo Devuelve: El nombre/mnemotécnica del trazo

source: Unrecognized unit type: %s
es: Tipo de unidad desconocido: %s

source: `depth` cannot be `None`, you must supply a depth
es: `depth` no se puede ser `None`, debe haber una profundidad

source: `depth` and `data` have different lengths. data/depth: %d/%d
es: `depth` y `data` tienen tamaños diferentes. data/depth: %d/%d

source: `mnemonic` and `name` are the same thing, please specify only one
es: `menmonic` y `name` son los mismos: se especifca solo uno

source: You must supply `mnemonic` or `name` (not both)
es: Se debe dar o `mnemonic`o `name`, y no los dos

source: method find_nearest: retrieve index and actual value of depth closes to input If you're looking for a value at 1000ft, but we only have a value at 998 ft and 1001 ft, will return 1001 ft and its index Args: value (number): The depth value you are looking for Returns: idx (number): The index of the value closest to what you're looking for value (number): The actual value at that index
es: método find_nearest (buscar más cerca): conseguir índice y valor de la profundidad más cerca de la buscada Si se busca un valor a 1000 pies, pero solo hay valor entre 998 pies y 1001 pies, se devuelve el índice y valor de 1000 pies. Args: value (número): La profundida que se busca Returns: idx (número): El índice del valor más cerca de lo que se busca value (número): El valor actual al índice

source: method set_data: set the data and optionally the unit, depth, and depth_unit Args: data (array): the data to set unit (str of pint.Unit): the unit associated with the data depth (array): an array of depth values depth_unit: the unit associated with the depth
es: método set_data (pon_datos): poner los datos y talvez la unidad, profundidad, y la unidad de profundidad. Args: data (tabla): los datos para poner unit (str o pint.Unit): la unidad de los datos depth (table): una tabla de los valores de profunidad depth_unit: la unidad de las profunidades

source: method get_data: returns the data Args: slice_by_depth (tuple): accepts a tuple using slice syntax (:) of positive values to select by depth force_unit (boolean): will force wrap the return in a pint.Quantity if True (default False) clean (boolean): a hack to deal with poorly behaved renderers, will remove all non-finite values (default False) Returns: the data
es: método get_data (saca_datos): devuelve los datos Args: slice_by_depth (tuple): se accepta un tuple que se usa la misma sintaxis de un `slice` de python, pero solo se aceptan valores positivos de las profundidas buscadas force_unit (booleano): se hace que el valor devuelto siempre esta envueleto por un pint.Quantity (Falso predeterminado) clean (booleano): un hackeo para lidear con mal comportamiento de los renderizadores- se quitan los valores no-finitos (Falso predeterminado) Devuelve: los datos

source: method set_depth: sets the depth Args: depth (array): The depth to set depth_unit (str or pint.Unit): The depth's associated unit
es: método set_depth (pon_profundidad): poner la tabla de la profundidad Args: depth (tabla): La table para poner depth_unit (str o pint.Unit): La unidad de la profunidad

source: method get_depth: returns the depth array Args: slice_by_depth (tuple): accepts a tuple using slice syntax (:) of positive values to select by depth force_unit (boolean): will force wrap the return in a pint.Quantity if True (default False) clean (boolean): a hack to deal with poorly behaved renderers, will remove depths where non-finite values in the data (default False) Returns: depth array or slice
es: método get_depth (saca_profundidad): devuelve la tabla de profunidad Args: slice_by_depth (tuple): se accepta un tuple que se usa la misma sintaxis de un `slice` de python, pero solo se aceptan valores positivos de las profundidas buscadas force_unit (booleano): se hace que el valor devuelto siempre esta envueleto por un pint.Quantity (Falso predeterminado) clean (booleano): un hackeo para lidear con mal comportamiento de los renderizadores- se quitan los valores no-finitos en la tabla de datos (Falso predeterminado) Devuelve: los datos

source: method set_unit: sets the unit associated with the data Args: unit (str or pint.Unit): the unit to set
es: método set_unit (pon_unidad): poner la unidad de los datos Args: unit (str o pint.Unit): la unidad par poner

source: method get_unit: gets the unit associated with the data Returns: the unit exactly as it was set
es: método get_unit (saca_unidad): devuelve la unidad de los datos: Devuelve: la unidad precisa como se fijó

source: method set_depth_unit: sets the unit associated with the depth Args: unit (str or pint.Unit): the unit to set
es: método set_depth_unit (pon_unidad_de_profunidad): Args: unidad (str o pint.Unit): la unidad para poner

source: method get_depth_unit: gets the unit associated with the depth Returns: the unit exactly as it was set
es: método get_depth_unit (saca_unidad_de_profunidad): se consigue la unidad de la tabla de profundidades Devuelve: la unidad como se pusó

source: method convert_depth_unit: will convert the depth to the specified unit, example ft to meters Since we cannot graph traces specified with different depth units, this can be used to make a permanent conversion. It will also change the recorded unit. Args: unit (str or pint.Unit): the target unit
es: método convert_depth_unit (convierte_unidad_de_profunidad): se convierte la table de profunidad a la unidad dada, por ejemplo ft a metros Debido que no podemos renderizar trazos dados donde las profunidades tienen unidades distintas, esto puede hacer un cambio permanente También, se cambia la unidad registrada y devuelte con get_depth_unit(). Args: unit (str o pint.Unit): la unidad querida

source: method convert_unit: a convenience function to change the unit of your data Most Trace functions don't permanently change and/or create new data arrays: this one does. Args: unit (str or pint.Unit): the target unit
es: método convert_unit (convierte_unidad): una función ayudable para cambiar la unidad de los datos Si bien la mayoria de funciones de Trace no cambian ni crean datos nuevos, esto sí. Args: unit (str o pint.Unit): la unidad querida

source: method set_mnemonic: set name/mnemonic of trace Args: mnemonic (str): The name/mnemonic you'd like to set
es: método set_mnemonic (pon_mnemotécnica): poner nombre/mnemotécnica del trazo Args: menomic (str): El nombre/mnemotécnica para poner

source: method get_mnemonic: get name/mnemonic of trace Returns: The name/mnemonic of the trace
es: método get_mnemonic (saca_mnemotécnica): conseguir el nombre/mnemotécnica del trazo Devuelve: El nombre/mnemotecnica del trazo

source: method get_dict: return relevant properties of trace as key-value dictionary Returns: A key-value dictionary
es: método get_dict: devuelve propriedades del trazo como diccionario de clave-valor Devuelve: Un diccionario

source: method get_theme: return the stored theme with a context object Returns: A theme object (pozo.themes.help()) with attached context for this trace.
es: método get_theme (saca_tema): devuelve el tema guardado con un objeto do contexto Devuelve: Un objeto de tema (pozo.themes.help()) con contexto adjunto para este trazo.

source: ***** sub-Object Directory (all have .help()):
es: ***** sub-Objeto Directorio (todo tiene .help()):
